---
kind: method
id: M:Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.IsAdaptiveComponentInstance(Autodesk.Revit.DB.FamilyInstance)
source: html/a68bade5-58d9-7fea-5070-5a28bb23e3c9.htm
---
# Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.IsAdaptiveComponentInstance Method

Verifies if a FamilyInstance is an Adaptive Component Instance.

## Syntax (C#)
```csharp
public static bool IsAdaptiveComponentInstance(
	FamilyInstance famInst
)
```

## Parameters
- **famInst** (`Autodesk.Revit.DB.FamilyInstance`) - The FamilyInstance

## Returns
True if the FamilyInstance has an Adaptive Component Instances.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null